tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Tool to install, manage and use Progressive Web Apps in Mozilla Firefox
brew "firefoxpwa"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Language server for the Go language
brew "gopls"
# Open-source video transcoder available for Linux, Mac, and Windows
brew "handbrake"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Helps you navigate your file system faster by learning your habits
brew "jump"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# 📦🚀 Fast, disk space efficient package manager
brew "pnpm"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Rust toolchain installer
brew "rustup-init"
# Display and control your Android device
brew "scrcpy"
# Cross-shell prompt for astronauts
brew "starship"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Application launcher and productivity software
cask "alfred"
# Distribution of the Python and R programming languages for scientific computing
cask "anaconda"
# Android SDK component
cask "android-platform-tools"
# Tools for building Android applications
cask "android-studio"
# Multi-track audio editor and recorder
cask "audacity"
# 3D creation suite
cask "blender"
# Design and prototype websites using the Bootstrap framework
cask "bootstrap-studio"
# Voice and text chat software
cask "discord"
# Reimagine your terminal
cask "fig"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Web browser
cask "firefox-developer-edition"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-sauce-code-pro-nerd-font"
# Free and open-source image editor
cask "gimp"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Open-source video transcoder
cask "handbrake"
# Utility to hide menu bar items
cask "hiddenbar"
# Vector graphics editor
cask "inkscape"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Keyboard customizer
cask "karabiner-elements"
# File archiver
cask "keka"
# Open-source keystroke visualizer
cask "keycastr"
# GPU-based terminal emulator
cask "kitty"
# Nintendo DS and DSi emulator
cask "melonds"
# Research management tool
cask "mendeley-reference-manager"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# App to write, plan, collaborate, and get organized
cask "notion"
# Open-source software for live streaming and screen recording
cask "obs"
# Android file transfer
cask "openmtp"
# Play PC games and connect with your friends
cask "origin"
# Collaboration platform for API development
cask "postman"
# Archive manager for data compression and backups
cask "rar"
# Control your tools with a few keystrokes
cask "raycast"
# Sets a minimum speed for built-in fans
cask "smcfancontrol"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Customizable email client
cask "thunderbird"
# Open-source code editor
cask "visual-studio-code"
# Desktop client for WhatsApp
cask "whatsapp"
