tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Lightweight and flexible command-line JSON processor
brew "jq"
# Helps you navigate your file system faster by learning your habits
brew "jump"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Platform built on V8 to build network applications
brew "node"
# 📦🚀 Fast, disk space efficient package manager
brew "pnpm"
# Rust toolchain installer
brew "rustup-init"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Distribution of the Python and R programming languages for scientific computing
cask "anaconda"
# Android SDK component
cask "android-platform-tools"
# Tools for building Android applications
cask "android-studio"
# Reimagine your terminal
cask "fig"
# Web browser
cask "firefox"
cask "font-fira-code-nerd-font"
# Free and open-source image editor
cask "gimp"
# Web browser
cask "google-chrome"
# Keyboard customizer
cask "karabiner-elements"
# GPU-based terminal emulator
cask "kitty"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Music streaming service
cask "spotify"
# Open-source code editor
cask "visual-studio-code"
